{"data":{"site":{"siteMetadata":{"title":"vcolavin","author":"Vincent Colavin"}},"markdownRemark":{"id":"a732dc4d-6661-53f2-82ec-88fcbb816d74","excerpt":"I’ve been working on a project called Nature of the Beast for a little while, and although I feature it prominently in my  portfolio  and other job-hunting…","html":"<p>I’ve been working on a project called Nature of the Beast for a little while, and although I feature it prominently in my <a href=\"https://vcolavin.com/temporary-portfolio\">portfolio</a> and other job-hunting material like cover letters, I don’t have much a deep public-facing description of what it is. I’ve tersely called it an interactive fiction project inspired by the form of the Unix terminal interface and 70s and 80s text-based adventures like Zork, but I haven’t done any deep dives.</p>\n<p>I’ve been reluctant to write about it more. In contrast, I spent a whole lot of time <a href=\"https://vcolavin.wordpress.com/tag/forest/\">blogging</a> about its unfinished spiritual predecessor, a rails-api project called <a href=\"https://github.com/vcolavin/forest\">The Restful Forest</a>. I also TDD’d almost every feature because I wanted to impress potential employers. I overthought it and lost interest. I got lost in the weeds.</p>\n<p>I don’t want that to happen with Nature of the Beast. I want instead to keep my momentum, to just build and write, without fretting too much over details, because I am building this for myself. This is a personal art project, not professional work, and I am intentionally preferring elegance and dynamism over speed or stability.</p>\n<p>Nature of the Beast is a work of fiction at least as much as it is an unconventional React app. I’ve spent roughly equal amounts of time writing prose as I have writing code. The processes are separate but have informed each other; like, if I want something to be possible narratively, I spend time coding to make it possible. I think this is basically how the developer of Dwarf Fortress approaches coding. Story-driven development.</p>\n<p>I want to write more about my process for both the fiction and code aspects of this project, because I get a lot out of both of them. The fiction is sort of a Lovecraftian pastiche (which has begun taking a lot of inspiration from <a href=\"https://gonehome.game/\">Gone Home</a> and <a href=\"https://ifdb.tads.org/viewgame?id=ltwvgb2lubkx82yi\">Bogeyman</a>), and the code does a few clever things I’m genuinely proud of.</p>\n<p>I won’t keep this project in the dark. I’m excited to share.</p>","frontmatter":{"title":"Nature of the Beast","date":"March 31, 2019","description":"An introduction to my interactive fiction project currently in development"}}},"pageContext":{"slug":"/2019/nature-of-the-beast/","previous":{"fields":{"slug":"/2019/switching-to-gatsby/"},"frontmatter":{"title":"Switching to Gatsby"}},"next":{"fields":{"slug":"/2019/promise-chaining/"},"frontmatter":{"title":"Chaing Arbitrary Promises in JS"}}}}