{"data":{"site":{"siteMetadata":{"title":"vcolavin","author":"Vincent Colavin"}},"markdownRemark":{"id":"317b08b4-8507-59b3-9657-07e3bf70ef94","excerpt":"This blog post is my trying to encapsulate the gist of a conversation I’ve had a bunch of times. It often starts with a relitigation of whether it’s in some way…","html":"<p>This blog post is my trying to encapsulate the gist of a conversation I’ve had a bunch of times. It often starts with a relitigation of whether it’s in some way a good thing that Trump won in 2016. The argument is that, as a result of Trump’s election, people are more awake to the racism in the US, and that Clinton was also bad anyways.</p>\n<p>Most recently I had this conversation triggered by a quote from <a href=\"https://www.youtube.com/watch?v=hpAMbpQ8J7g\">this Zizek talk</a>:</p>\n<blockquote>\n<p>The worst slave owners were those who were kind to their slaves.</p>\n</blockquote>\n<p>Here’s what I think is a useful translation, given the context:</p>\n<blockquote>\n<p>The problem with slavery isn’t that enslaved people are mistreated, it is that they are enslaved. At least the cruel slave owner is sincere. The kind one is dishonest, and doing nothing to solve the underlying problem while profiting from slavery. Worse, his behavior makes it easier to justify the institution of slavery, thus prolonging the injustice.</p>\n</blockquote>\n<p>While I see where this is coming from, I disagree. There’s a certain strain of radicalism that rejects incremental change in favor of overthrowing the entire unjust system. This is an enticing idea, but practically, the insistence on revolution tends leaves the most vulnerable people up shit creek.</p>\n<p>In other words, it would certainly be best if there were no unjust or oppressive systems (e.g. capitalism). That being said, as long as we exist within an unjust system, it is worthwhile to do the right thing to minimize the suffering of others, even if that minimization does not dismantle the unjust system. Further, I don’t believe we’ll ever be completely free of injustice, and we can’t use the existence of injustice as a reason to not act righteously.</p>\n<p>In other other words, <em>why not both</em>?</p>\n<p>As a side note, I understand that Zizek’s whole schtick is that he says controversial and vapid things in order to generate publicity. In this way he is like a Marxist version of Jordan Peterson.</p>\n<p>As another side note, the talk from which this came is like 10 minutes long but can be really succinctly distilled into the statement “capitalism will not fix capitalism”. I don’t disagree but <a href=\"https://www.activistgraduateschool.org/on-the-masters-tools\">this isn’t a new idea</a>.</p>\n<p>Variations on this choice come up all the time in real life, so it’s not just a thought experiment. Macron is a pawn of the rich but he is emphatically not a Nazi, which can’t be said of LePen. Trudeau is a dishonest bastard but he’s a better PM to the indigenous peoples of Canada than Harper any day of the week.</p>\n<p>And somehow what I keep hearing is “well at least Trump is sincere”. Well so was Hitler.</p>\n<p>There is something perversely refreshing about the overt racism of the Trumps and Dutertes and Bolsanaros of the world. These men say what they feel (not accounting for the tremendous amount of lying they tend to do). After years of the dishonest centrist neoliberalism of Reagan, the Bushes, the Clintons, and even Obama, it’s nice to finally not be gaslit. Trump may be a misogynistic anti-semite, but at least he’s pretty clear about it.</p>\n<p>And this isn’t exclusively white bullshit: one of the most memorable and challenging scenes in <a href=\"https://duckduckgo.com/?q=imdb+accidental+courtesy&#x26;t=ffab&#x26;ia=web\">Accidental Courtesy</a> (which is itself a hugely challenging documentary) was when Daryl Davis (a black civil rights activist who befriends and gradually deradicalizes KKK members) sits down to talk with young Baltimore Black Lives Matter activists. It devolves into a bitter argument. During that argument, which occurred prior to the 2016 election, one of the BLM activists expressed hope that Trump would become president. I forget his exact words, but it was something to the effect of “at least then white supremacy will be out in the open”.</p>\n<p>There’s so, so much to unpack in that one scene alone. I can’t find a youtube clip of it, but <a href=\"https://www.thedailybeast.com/kkk-doc-sparks-controversy-at-sxsw-daryl-davis-clashes-with-blm-activists-in-film-during-qanda\">here’s a description at least</a>, and <a href=\"https://www.youtube.com/watch?v=1JMvRoVTyq8\">here’s a panel featuring Davis and activist Kwame Rose</a>.</p>\n<p>I recognize and understand that there is depth and nuance to this topic. And I’m not saying that you shouldn’t advocate for revolution or shut down ICE or take other radical action. You should probably do those things, just also make sure to vote.</p>\n<p>Here’s my hot take: Trump’s election and presidency are and have been a catastrophe. People have died and will continue to die because of it. So many thousands of lives have been destroyed. If their lives are the price we pay to pave the way to a righteous revolution, it will not have been worth it. There is no question, Clinton would have been better.</p>\n<p>And this might sound a little clumsy or shoehorned but some version of the question of whether to vote for a less-evil candidate doesn’t just come around every four years; it is central to how we choose to live our lives. Consider the following quotidian dilemmas:</p>\n<ul>\n<li>Should you take the bus to work or drive your car?</li>\n<li>Should you eat meat?</li>\n<li>Should you tip your waiter?</li>\n<li>Should you give money to a panhandler?</li>\n</ul>\n<p>Or more generally, “If I am part of an immoral system, is it worthwhile to make small moral decisions?”</p>\n<p>I assert that it is never wrong to do the right thing, even if it’s within an immoral system. Tip your waiter even though the notion of tipping is garbage. Ride your bike to work even if it’s not going to undo climate change. <a href=\"https://www.3quarksdaily.com/3quarksdaily/2014/02/eating-animals-and-personal-guilt-against-the-individualization-of-responsibility-for-factory-farmin.html\">Do these things not because they will solve underlying problems, but because they are the right things to do.</a> Because they count. Do them because you are a person with integrity, who has the moral strength to make difficult decisions. And when the opportunity to take part in collective action to dismantle or improve systems comes along, do that too.</p>\n<p>And, yes, vote for the center-left politician in the general election even if you don’t like her, because she’s not Trump.</p>\n<p>What’s the alternative? Live in the woods and pretend like you can abstain from taking responsibility for our flawed and unjust world? That’s nothing.</p>\n<p>In conclusion,</p>\n<ol>\n<li>If Joe Biden or some other centrist asshole like O’Rourke or Buttigieg wins the nomination, just vote for them in the general. The alternative is not just a teachable moment; it is annihilation.</li>\n<li>Do radical activism <em>in addition to</em> the unexciting work of voting for the better of two candidates.</li>\n<li>Eat less meat.</li>\n</ol>","frontmatter":{"title":"Was Trump's Election a Positive Thing?","date":"May 07, 2019","description":"We need to be distinct in our understanding between the world in which we live, and the world in which we'd like to live."}}},"pageContext":{"slug":"/2019/clinton-or-trump/","previous":{"fields":{"slug":"/2019/interview-questions/"},"frontmatter":{"title":"Coding Interview Questions I've Been Asked"}},"next":null}}